app/views/api/videos/_video.json.jbuilder

INSERT INTO "videos" ("author_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 19], ["title", "jjkh"], ["description", "gjghj"], ["created_at", "2019-09-16 17:56:19.448951"], ["updated_at", "2019-09-16 17:56:19.448951"]]
---
json.username video.user.username
json.published video.created_at.strftime("%B %d, %Y")