app/controllers/api/videos_controller.rb

  def create
    if params[:video][:video] == "null"
      render json: ["Please select video"], status: 406
      return nil
    elsif params[:video][:thumbnail] == "null"
      render json: ["Please select thumbnail"], status: 406
      return nil
    end
    @video = Video.new(video_params)
    @video.author_id = current_user.id
    if @video.save!
---
INSERT INTO "videos" ("author_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 19], ["title", "kerm"], ["description", "asf"], ["created_at", "2019-09-16 16:52:53.862989"], ["updated_at", "2019-09-16 16:52:53.862989"]]

  def update
    @video = current_user.videos.find(params[:id])
    if @video.update_attributes(video_params)
---
UPDATE "videos" SET "updated_at" = $1 WHERE "videos"."id" = $2  [["updated_at", "2019-09-16 17:40:19.483458"], ["id", 3]]